LinePatternElement Class
 An element that represents a line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class LinePatternElement : Element
Visual Basic
Public Class LinePatternElement _
	Inherits Element
Visual C++
public ref class LinePatternElement : public Element
Remarks
 The LinePatternElement represents a line pattern in a project. It enables the user to retrieve, modify or create a line pattern in a project.
Inheritance Hierarchy
SystemObject
 Autodesk.Revit.DBElement
 Autodesk.Revit.DBLinePatternElement
See Also
LinePatternElement Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →